In [3]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
df['col2'].nunique()

3

In [8]:
df['col1'].value_counts()

4    1
3    1
2    1
1    1
Name: col1, dtype: int64

In [10]:
df[df['col1']>3]

   col1  col2 col3
3     4   444  xyz

In [15]:
def times(x):
    return x**2

In [16]:
df['col1'].apply(times)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [20]:
df['col2'] = df['col2'].apply(lambda x:x**3)

In [21]:
df

   col1       col2 col3
0     1   87528384  abc
1     2  170953875  def
2     3  295408296  ghi
3     4   87528384  xyz

In [22]:
df.sort_values('col2')

   col1       col2 col3
0     1   87528384  abc
3     4   87528384  xyz
1     2  170953875  def
2     3  295408296  ghi

In [23]:
# df.pivot_table(value)

In [ ]:
## DATA INPUT AND OUTPUT Documents/pythn_txtbooks/[FreeAllCourse.Com] Udemy - Python for Data Science and Machine Learning Bootcamp$